
## :x: Apply Failed (account-delete-monitor-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/16339)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.eventtracker_lambda_lambda-default-file_1211ABBC: Reading...
data.archive_file.eventtracker_lambda_lambda-default-file_1211ABBC: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5: Refreshing state... [id=PAJ2DUU]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B: Refreshing state... [id=PX9ECF4]
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392: Refreshing state... [id=PTATC2E]
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C: Refreshing state... [id=PEVQE6H]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue-Deadletter]
aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0: Refreshing state... [id=e59de1dc-335d-4b1f-aacf-8d3cfb61118a:AccountDeleteMonitor-Dev-EventTracker-Lambda]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.event-table_dynamodb_table_49BD839C: Refreshing state... [id=ADM-Dev-event-table]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.eventtracker_lambda-code-deploy_code-deploy-assume-role-policy-document_B18805A8: Reading...
data.aws_iam_policy_document.eventtracker_lambda-code-deploy_code-deploy-assume-role-policy-document_B18805A8: Read complete after 0s [id=4250039221]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
aws_sqs_queue.sns-topic-dql: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-SNS-Topics-DLQ]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.eventtracker_sentry-dsn_D349DC66: Reading...
data.aws_iam_policy_document.eventtracker_lambda_execution-policy-document_F9298495: Reading...
data.aws_iam_policy_document.eventtracker_lambda_execution-policy-document_F9298495: Read complete after 0s [id=2591764522]
data.aws_iam_policy_document.eventtracker_lambda_assume-policy-document_F8F8B6BD: Reading...
data.aws_iam_policy_document.eventtracker_lambda_assume-policy-document_F8F8B6BD: Read complete after 0s [id=1349007126]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.eventtracker_service-hash_907E4970: Reading...
data.aws_ssm_parameter.eventtracker_sentry-dsn_D349DC66: Read complete after 0s [id=/AccountDeleteMonitor/Dev/SENTRY_DSN]
aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311: Refreshing state... [id=pocket-accountdeletemonitor-dev-eventtracker]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue]
aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole]
data.aws_ssm_parameter.eventtracker_service-hash_907E4970: Read complete after 0s [id=/AccountDeleteMonitor/CircleCI/Dev/SERVICE_HASH]
data.aws_iam_policy_document.EventTracker-lambda-dynamo-policy-doc: Reading...
data.aws_iam_policy_document.EventTracker-lambda-dynamo-policy-doc: Read complete after 0s [id=943073984]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.terraform_remote_state.incident_management: Read complete after 1s
aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDeleteMonitor-Dev-EventTracker-ExecutionRolePolicy]
data.aws_iam_policy_document.adm-sns-dlq-policy-document: Reading...
data.aws_iam_policy_document.adm-sns-dlq-policy-document: Read complete after 0s [id=3057489341]
aws_iam_role.eventtracker_lambda_execution-role_6AC27719: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_sns_topic_subscription.UserMerge-Topic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic:d5ce198f-fc64-49da-8862-641c33a69c97]
aws_sns_topic_subscription.UserEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:29c9c40c-d967-4e6f-b940-c0e6c41ac7f1]
data.aws_iam_policy_document.eventtracker_lambda_sqs_policy_DEBDCD47: Reading...
data.aws_iam_policy_document.eventtracker_lambda_sqs_policy_DEBDCD47: Read complete after 0s [id=124770717]
data.aws_iam_policy_document.adm-sns-sqs-policy-document: Reading...
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PLQT521]
data.aws_iam_policy_document.adm-sns-sqs-policy-document: Read complete after 0s [id=1952077213]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P2U74EH]
aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66: Refreshing state... [id=e2856008-16c3-4bd8-96e3-6e2dfefd0311]
aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole-20220809154045381900000001]
aws_sqs_queue_policy.adm-sns-dlq-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-SNS-Topics-DLQ]
aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663: Refreshing state... [id=pocket-accountdeletemonitor-dev-eventtracker]
aws_sqs_queue_policy.adm-sns-sqs-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue]
aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154045504800000002]
aws_iam_policy.eventtracker_sqs-policy_32E8FFAA: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDeleteMonitor-Dev-EventTracker-LambdaSQSPolicy]
aws_iam_policy.EventTracker-lambda-dynamo-policy: Refreshing state... [id=arn:aws:iam::410318598490:policy/account-delete-monitor-EventTracker-DynamoLambdaPolicy]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:8a159c9f-3311-49c5-a3a5-423b75786f02]
aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154135337800000004]
aws_iam_role_policy_attachment.EventTracker-execution-role-policy-attachment: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154100125700000003]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-012481e83ffa5e152]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical:4334eb63-eb33-4374-8616-c4802e5d3129]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_lambda_function.eventtracker_lambda_2D56166D: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-Function]
aws_lambda_alias.eventtracker_lambda_alias_63DC690A: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:AccountDeleteMonitor-Dev-EventTracker-Function:DEPLOYED]
aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0: Refreshing state... [id=/aws/lambda/AccountDeleteMonitor-Dev-EventTracker-Function]
aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28: Refreshing state... [id=514cb78e-d5a5-4410-b03f-0e870cdd3104]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.accountdeletemonitor_eventtracker_lambda_loggroup_FBEFDD08 has moved to aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0
    resource "aws_cloudwatch_log_group" "eventtracker_lambda_log-group_D52B53E0" {
        id                = "/aws/lambda/AccountDeleteMonitor-Dev-EventTracker-Function"
        name              = "/aws/lambda/AccountDeleteMonitor-Dev-EventTracker-Function"
        tags              = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_app.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeployapp_1EF789BA has moved to aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0
    resource "aws_codedeploy_app" "eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0" {
        id               = "e59de1dc-335d-4b1f-aacf-8d3cfb61118a:AccountDeleteMonitor-Dev-EventTracker-Lambda"
        name             = "AccountDeleteMonitor-Dev-EventTracker-Lambda"
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeploymentgroup_B3D6CC7C has moved to aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66
    resource "aws_codedeploy_deployment_group" "eventtracker_lambda-code-deploy_code-deployment-group_C430DA66" {
        id                          = "e2856008-16c3-4bd8-96e3-6e2dfefd0311"
        tags                        = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_dynamodb_table.accountdeletemonitor_eventtable_dynamodbtable_DA277224 has moved to aws_dynamodb_table.event-table_dynamodb_table_49BD839C
    resource "aws_dynamodb_table" "event-table_dynamodb_table_49BD839C" {
        id                          = "ADM-Dev-event-table"
        name                        = "ADM-Dev-event-table"
        tags                        = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.accountdeletemonitor_EventTrackerlambdadynamopolicy_79C186FE has moved to aws_iam_policy.EventTracker-lambda-dynamo-policy
    resource "aws_iam_policy" "EventTracker-lambda-dynamo-policy" {
        id        = "arn:aws:iam::410318598490:policy/account-delete-monitor-EventTracker-DynamoLambdaPolicy"
        name      = "account-delete-monitor-EventTracker-DynamoLambdaPolicy"
        tags      = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.accountdeletemonitor_eventtracker_lambda_executionpolicy_D4355D22 has moved to aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0
    resource "aws_iam_policy" "eventtracker_lambda_execution-policy_A74ACAF0" {
        id        = "arn:aws:iam::410318598490:policy/AccountDeleteMonitor-Dev-EventTracker-ExecutionRolePolicy"
        name      = "AccountDeleteMonitor-Dev-EventTracker-ExecutionRolePolicy"
        tags      = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.accountdeletemonitor_eventtracker_sqspolicy_4144A2F6 has moved to aws_iam_policy.eventtracker_sqs-policy_32E8FFAA
    resource "aws_iam_policy" "eventtracker_sqs-policy_32E8FFAA" {
        id        = "arn:aws:iam::410318598490:policy/AccountDeleteMonitor-Dev-EventTracker-LambdaSQSPolicy"
        name      = "AccountDeleteMonitor-Dev-EventTracker-LambdaSQSPolicy"
        tags      = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeployrole_5DE47462 has moved to aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3
    resource "aws_iam_role" "eventtracker_lambda-code-deploy_code-deploy-role_761181E3" {
        id                    = "AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole"
        name                  = "AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.accountdeletemonitor_eventtracker_lambda_executionrole_F9DABED8 has moved to aws_iam_role.eventtracker_lambda_execution-role_6AC27719
    resource "aws_iam_role" "eventtracker_lambda_execution-role_6AC27719" {
        id                    = "AccountDeleteMonitor-Dev-EventTracker-ExecutionRole"
        name                  = "AccountDeleteMonitor-Dev-EventTracker-ExecutionRole"
        tags                  = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_EventTrackerexecutionrolepolicyattachment_A3608833 has moved to aws_iam_role_policy_attachment.EventTracker-execution-role-policy-attachment
    resource "aws_iam_role_policy_attachment" "EventTracker-execution-role-policy-attachment" {
        id         = "AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154100125700000003"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_executionrolepolicyattachment_E7F86C18 has moved to aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C
    resource "aws_iam_role_policy_attachment" "eventtracker_execution-role-policy-attachment_88191D7C" {
        id         = "AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154135337800000004"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeploypolicyattachment_25DA19C6 has moved to aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD
    resource "aws_iam_role_policy_attachment" "eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD" {
        id         = "AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole-20220809154045381900000001"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_lambda_executionrolepolicyattachment_77CDEDA4 has moved to aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A
    resource "aws_iam_role_policy_attachment" "eventtracker_lambda_execution-role-policy-attachment_4A84019A" {
        id         = "AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154045504800000002"
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_alias.accountdeletemonitor_eventtracker_lambda_alias_53715695 has moved to aws_lambda_alias.eventtracker_lambda_alias_63DC690A
    resource "aws_lambda_alias" "eventtracker_lambda_alias_63DC690A" {
        id               = "arn:aws:lambda:us-east-1:410318598490:function:AccountDeleteMonitor-Dev-EventTracker-Function:DEPLOYED"
        name             = "DEPLOYED"
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.accountdeletemonitor_eventtracker_lambdaeventsourcemapping_CF99BB2B has moved to aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28
    resource "aws_lambda_event_source_mapping" "eventtracker_lambda_event_source_mapping_9B8B4F28" {
        id                                 = "514cb78e-d5a5-4410-b03f-0e870cdd3104"
        # (18 unchanged attributes hidden)
    }

  # aws_lambda_function.accountdeletemonitor_eventtracker_lambda_827686FF has moved to aws_lambda_function.eventtracker_lambda_2D56166D
    resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "AccountDeleteMonitor-Dev-EventTracker-Function"
        tags                           = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_s3_bucket.accountdeletemonitor_eventtracker_lambda_codebucket_3A72C0E3 has moved to aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311
    resource "aws_s3_bucket" "eventtracker_lambda_code-bucket_E2F7C311" {
        id                          = "pocket-accountdeletemonitor-dev-eventtracker"
        tags                        = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32 will be created
  + resource "aws_s3_bucket_acl" "eventtracker_lambda_code-bucket-acl_94F01E32" {
      + acl    = "private"
      + bucket = "pocket-accountdeletemonitor-dev-eventtracker"
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91 will be created
  + resource "aws_s3_bucket_ownership_controls" "eventtracker_lambda_code-bucket-ownership-controls_AC55EF91" {
      + bucket = "pocket-accountdeletemonitor-dev-eventtracker"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.accountdeletemonitor_eventtracker_lambda_codebucketpublicaccessblock_1A877CF9 has moved to aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663
    resource "aws_s3_bucket_public_access_block" "eventtracker_lambda_code-bucket-public-access-block_5C535663" {
        id                      = "pocket-accountdeletemonitor-dev-eventtracker"
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic.accountdeletemonitor_pagerduty_alarmcriticaltopic_2B2C4149 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical"
        name                                     = "AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.accountdeletemonitor_pagerduty_alarmnoncriticaltopic_8C1C98C5 has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical"
        name                                     = "AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.accountdeletemonitor_UserEventTopicsnssubscription_110C320E has moved to aws_sns_topic_subscription.UserEventTopic-sns-subscription
    resource "aws_sns_topic_subscription" "UserEventTopic-sns-subscription" {
        id                              = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:29c9c40c-d967-4e6f-b940-c0e6c41ac7f1"
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.accountdeletemonitor_UserMergeTopicsnssubscription_4173F1D8 has moved to aws_sns_topic_subscription.UserMerge-Topic-sns-subscription
    resource "aws_sns_topic_subscription" "UserMerge-Topic-sns-subscription" {
        id                              = "arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic:d5ce198f-fc64-49da-8862-641c33a69c97"
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.accountdeletemonitor_pagerduty_alarmcriticalsubscription_8F185E56)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:8a159c9f-3311-49c5-a3a5-423b75786f02" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/abac1c4707fe4a0fd00a5ea93c9d8d61/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:8a159c9f-3311-49c5-a3a5-423b75786f02" -> (known after apply)
      ~ owner_id                        = "410318598490" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.accountdeletemonitor_pagerduty_alarmnoncriticalsubscription_6D302123)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical:4334eb63-eb33-4374-8616-c4802e5d3129" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/1a55b79ee1204a01d019e3cc5deef267/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical:4334eb63-eb33-4374-8616-c4802e5d3129" -> (known after apply)
      ~ owner_id                        = "410318598490" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdeletemonitor_eventtracker_lambdasqsqueue_B426A0A6 has moved to aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE
    resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_3DFE90FE" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue"
        name                              = "AccountDeleteMonitor-Dev-EventTracker-Queue"
        tags                              = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdeletemonitor_eventtracker_lambdasqsqueue_redrivesqsqueue_006B9D2C has moved to aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55
    resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue-Deadletter"
        name                              = "AccountDeleteMonitor-Dev-EventTracker-Queue-Deadletter"
        tags                              = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdeletemonitor_snstopicdql_9F197074 has moved to aws_sqs_queue.sns-topic-dql
    resource "aws_sqs_queue" "sns-topic-dql" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-SNS-Topics-DLQ"
        name                              = "AccountDeleteMonitor-Dev-SNS-Topics-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "AccountDeleteMonitor"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdeletemonitor_admsnsdlqpolicy_8ADA1C83 has moved to aws_sqs_queue_policy.adm-sns-dlq-policy
    resource "aws_sqs_queue_policy" "adm-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-SNS-Topics-DLQ"
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdeletemonitor_admsnssqspolicy_B903BC41 has moved to aws_sqs_queue_policy.adm-sns-sqs-policy
    resource "aws_sqs_queue_policy" "adm-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue"
        # (2 unchanged attributes hidden)
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be updated in-place
  # (moved from pagerduty_service.accountdeletemonitor_pagerduty_pagerdutycritical_15CE57AC)
  ~ resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      ~ escalation_policy       = "PQ2EUPZ" -> "PXOQVEP"
        id                      = "PLQT521"
        name                    = "AccountDeleteMonitor-Dev-PagerDuty-Critical"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.accountdeletemonitor_pagerduty_pagerdutynoncritical_2E782BA0 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "P2U74EH"
        name                    = "AccountDeleteMonitor-Dev-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392 will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392 is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392" {
      - html_url        = "https://mozilla.pagerduty.com/services/PLQT521/integrations/PTATC2E" -> null
      - id              = "PTATC2E" -> null
      - integration_key = "abac1c4707fe4a0fd00a5ea93c9d8d61" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PLQT521" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C" {
      - html_url        = "https://mozilla.pagerduty.com/services/P2U74EH/integrations/PEVQE6H" -> null
      - id              = "PEVQE6H" -> null
      - integration_key = "1a55b79ee1204a01d019e3cc5deef267" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "P2U74EH" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B" {
      - html_url        = "https://mozilla.pagerduty.com/services/PLQT521/integrations/PX9ECF4" -> null
      - id              = "PX9ECF4" -> null
      - integration_key = "21d9a55bfb3e4100c0e7fbf68c3946ca" -> null
      - name            = "Sentry" -> null
      - service         = "PLQT521" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5 will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5 is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5" {
      - html_url        = "https://mozilla.pagerduty.com/services/P2U74EH/integrations/PAJ2DUU" -> null
      - id              = "PAJ2DUU" -> null
      - integration_key = "501efc832ecd4008c0b5c4b472a2cb01" -> null
      - name            = "Sentry" -> null
      - service         = "P2U74EH" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PLQT521"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "P2U74EH"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PLQT521"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "P2U74EH"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 8 to add, 1 to change, 6 to destroy.
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B: Destroying... [id=PX9ECF4]
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5: Destroying... [id=PAJ2DUU]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:8a159c9f-3311-49c5-a3a5-423b75786f02]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical:4334eb63-eb33-4374-8616-c4802e5d3129]
aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C: Destroying... [id=PEVQE6H]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392: Destroying... [id=PTATC2E]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Modifying... [id=PLQT521]
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5: Destruction complete after 1s
aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91: Creation complete after 1s [id=pocket-accountdeletemonitor-dev-eventtracker]
aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32: Creating...
aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32: Creation complete after 0s [id=pocket-accountdeletemonitor-dev-eventtracker,private]
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B: Destruction complete after 1s
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C: Destruction complete after 1s
pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392: Destruction complete after 1s
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Modifications complete after 1s [id=PLQT521]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 1s [id=PWVAAC0]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 1s [id=PSJPZMA]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PPN1ZNN]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=P8ADYXK]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical:766cdcf7-dd3a-416c-bba7-6226514d882f]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [10s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [20s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [30s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [40s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [50s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m0s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m10s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m20s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m30s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m40s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m50s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [2m0s elapsed]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1144, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1144:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Error: waiting for SNS Topic Subscription (arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:235bbd49-80b1-42e2-987d-f176ddc97242) confirmation: timeout while waiting for state to become 'false' (last state: 'true', timeout: 2m0s)
│ 
│   with aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84,
│   on cdk.tf.json line 1148, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1148:       },
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"2c247cf8-9542-4445-b2a0-d5e239669d25","JobName":"account-delete-monitor_infrastructure_apply_dev","PRNumber":82,"Program":"tfcmt","SHA1":"87e8c50841e4d9f41f1dda17a268527ac74ddd49","Target":"account-delete-monitor-cdk-dev","Vars":{}} -->